//=============================================================================
//
// BG処理 [bg.h]
// Author : GP11B292 29 濱崎小春
//
//=============================================================================
#pragma once

// マクロ定義
#define BG_TEXTURE			_T("data/TEXTURE/★bg_001.png")	// サンプル用画像
#define BG_SIZE_W			(640)	// テクスチャサイズ
#define BG_SIZE_H			(480)	// 同上
#define BG_POS_X			(0)		// ポリゴンの初期位置X(左上)
#define BG_POS_Y			(0)		// 同上
#define NUM_BG				(2)		//背景の数

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitBG(int type);
void UninitBG(void);
void UpdateBG(void);
void DrawBG(void);
void *GetBG(void);

